app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 AND (`articles`.user_id = 7) ORDER BY published_at DESC, title ASC LIMIT 1
---
  def edit
    @article = current_user.articles.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `published_at`, `created_at`, `updated_at`, `excerpt`, `location`, `user_id`) VALUES ('has_man', 'model has many other models', '2011-12-01 15:13:00', '2011-12-04 15:06:31', '2011-12-04 15:06:31', 'efvsd', 'werfw', NULL)
---
  def create
    @article = current_user.articles.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 AND (`articles`.user_id = 7) ORDER BY published_at DESC, title ASC LIMIT 1
UPDATE `articles` SET `location` = 'sdfdfdfdfd', `updated_at` = '2011-12-14 21:38:11' WHERE `articles`.`id` = 11
---
  def update
    @article = current_user.articles.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 AND (`articles`.user_id = 7) ORDER BY published_at DESC, title ASC LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 10
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def notify_friend
  	@article = Article.find(params[:id])