app/controllers/comments_controller.rb

  def create
    @comment = @article.comments.new(params[:comment])

    if @comment.save
---
INSERT INTO `comments` (`article_id`, `name`, `email`, `body`, `created_at`, `updated_at`) VALUES (1, 'ymut', 'nuytb', 'ynutbg', '2011-12-04 15:47:07', '2011-12-04 15:47:07')

  def destroy
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 2 AND (`comments`.article_id = 1) LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2

 def load_article
  @article = Article.find(params[:article_id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 7 LIMIT 1