app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`email`, `hashed_password`, `created_at`, `updated_at`) VALUES ('sfs@we.ew', '603e6907398c7e74e25c0ae8ec3a03ffac7c9bb4', '2011-12-14 19:57:35', '2011-12-14 19:57:35')